In [1]:
# データ分析用のライブラリ
import pandas as pd
import numpy as np

#### 適当なデータフレーム作成

In [2]:
c_dict ={
    'T番号':['0000111-1234567', '0000222-2345678', '0000333-3456789'],
    'company':['A', 'B', 'C']
}

c_df = pd.DataFrame(c_dict)
c_df

               T番号 company
0  0000111-1234567       A
1  0000222-2345678       B
2  0000333-3456789       C

## 前から1文字目を削除

In [3]:
c_df['T番号_f'] = c_df['T番号'].apply(lambda x: x[1:])
c_df

               T番号 company           T番号_f
0  0000111-1234567       A  000111-1234567
1  0000222-2345678       B  000222-2345678
2  0000333-3456789       C  000333-3456789

## 後ろから1文字目を削除

In [4]:
c_df['T番号_b'] = c_df['T番号'].apply(lambda x: x[:-1])
c_df

               T番号 company           T番号_f           T番号_b
0  0000111-1234567       A  000111-1234567  0000111-123456
1  0000222-2345678       B  000222-2345678  0000222-234567
2  0000333-3456789       C  000333-3456789  0000333-345678

## 前から1文字目、後ろから1文字目を削除

In [5]:
c_df['T番号_fb'] = c_df['T番号'].apply(lambda x: x[1:-1])
c_df

               T番号 company           T番号_f           T番号_b         T番号_fb
0  0000111-1234567       A  000111-1234567  0000111-123456  000111-123456
1  0000222-2345678       B  000222-2345678  0000222-234567  000222-234567
2  0000333-3456789       C  000333-3456789  0000333-345678  000333-345678